InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Штрихкоды/Ext/RecordSetModule.bsl
&После("ОбработкаПроверкиЗаполнения")
Процедура КочетовОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для каждого стр из ЭтотОбъект Цикл
		Если (стр.ТипШтрихкода=ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13 или стр.ТипШтрихкода=ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8) 
				и глПроверкаШК(стр.ШтрихКод,стр.ТипШтрихкода)=0 тогда
					отказ=Истина;
		КонецЕсли;
		Если СтрДлина(стр.ШтрихКод)> 13 Тогда 
			Сообщить("Не верная длина штрихкода: "+стр.ШтрихКод+"!");
			отказ=Истина;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры                      


Функция глПроверкаШК(Код,ТипШтрихкода)
	Если НЕ (СтрДлина(Код) = 13 и ТипШтрихкода=ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13) 
		и НЕ (СтрДлина(Код) = 8 и ТипШтрихкода=ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8)Тогда
			Сообщить("Не верная длина штрихкода: "+Код+"!");
			Возврат Ложь;
	КонецЕсли;
 
	Чис2=0;	
	ЧисЧетные   = 0;
	ЧисНечетные = 0;
	Для ЧисХ=1 По СтрДлина(Код)-1 Цикл
		Если (ЧисХ%2 = 0 и СтрДлина(Код) = 13) или 
			(НЕ ЧисХ%2 = 0 и СтрДлина(Код) = 8) Тогда 
			ЧисЧетные = ЧисЧетные + Число(Сред(Код, ЧисХ, 1));
		Иначе
   			ЧисНечетные = ЧисНечетные + Число(Сред(Код, ЧисХ, 1));
		КонецЕсли;		
	КонецЦикла;	
	Чис2 = (ЧисЧетные * 3) + ЧисНечетные;
	БлижайшееКратное = Чис2;
	Пока НЕ БлижайшееКратное%10 = 0 Цикл
		БлижайшееКратное = БлижайшееКратное + 1;
	КонецЦикла;
	КонтрольноеЧисло = БлижайшееКратное - Чис2;
	
	Если Число(Сред(Код,ЧисХ,1)) <> Число(Строка(КонтрольноеЧисло)) Тогда
		Сообщить("Расчитанная контрольная сумма введённого шрихкода не совпадает с контрольной цифрой! Попробуйте ввести еще раз. Штрихкод: "+Код);
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;

КонецФункции

&После("ПриЗаписи")
Процедура КочетовПриЗаписи(Отказ, Замещение)
	
	ЭтотОбъект.Прочитать();
	
	наб=ЭтотОбъект.Выгрузить();
	Для каждого стр из Наб Цикл	
		попытка
			ВнешниеИсточникиДанных.Пикник23.dbo_InsertBarcode(стр.штрихкод,Число(стр.владелец.ххх_ИдЦентр));
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Если не Отказ Тогда
		Выборка = ПланыОбмена.ПланОбменаСОборудованием.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Если Выборка.Ссылка = ПланыОбмена.ПланОбменаСОборудованием.ЭтотУзел() или ТипЗнч(выборка.Оборудование)=Тип("СправочникСсылка.ххх_ПодключаемоеОборудование") Тогда
				Продолжить;
			КонецЕсли;
			//Для каждого Стр из наб Цикл
				//наб.
				ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, ЭтотОбъект); 		
			//КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	
	
КонецПроцедуры
